olegator1506/audio/progs/esp32-adau/include/my-project1_IC_1_REG.h
/* Playback Line Out Mono (IC 1) */
#define R34_PB_MONO_PWRUP_IC_1                    0x1    /* 1b	[0] */
#define R34_PB_MONO_MUTE_IC_1                     0x0    /* 0b	[1] */
#define R34_PB_MONO_VOL_IC_1                      0x39   /* 111001b	[7:2] */
#define R34_PB_MONO_PWRUP_IC_1_MASK               0x1
#define R34_PB_MONO_PWRUP_IC_1_SHIFT              0
#define R34_PB_MONO_MUTE_IC_1_MASK                0x2
#define R34_PB_MONO_MUTE_IC_1_SHIFT               1
#define R34_PB_MONO_VOL_IC_1_MASK                 0xFC
#define R34_PB_MONO_VOL_IC_1_SHIFT                2

/* Playback Control (IC 1) */
#define R35_OBSOLETE_BIT_IC_1                     0x0    /* 0b	[0] */
#define R35_PLAYBACK_ANALOG_VOL_SLEW_RATE_IC_1    0x0    /* 00b	[2:1] */
#define R35_POPLESS_IC_1                          0x0    /* 0b	[3] */
#define R35_POP_MODE_IC_1                         0x0    /* 0b	[4] */
#define R35_OBSOLETE_BIT_IC_1_MASK                0x1
#define R35_OBSOLETE_BIT_IC_1_SHIFT               0
#define R35_PLAYBACK_ANALOG_VOL_SLEW_RATE_IC_1_MASK 0x6
#define R35_PLAYBACK_ANALOG_VOL_SLEW_RATE_IC_1_SHIFT 1
#define R35_POPLESS_IC_1_MASK                     0x8
#define R35_POPLESS_IC_1_SHIFT                    3
#define R35_POP_MODE_IC_1_MASK                    0x10
#define R35_POP_MODE_IC_1_SHIFT                   4

/* Playback Power Management (IC 1) */
#define R36_PB_BCKEND_LEFT_ENABLE_IC_1            0x1    /* 1b	[0] */
#define R36_PB_BCKEND_RIGHT_ENABLE_IC_1           0x1    /* 1b	[1] */
#define R36_PB_BACK_CTRL_IC_1                     0x0    /* 00b	[3:2] */
#define R36_PB_DAC_BIAS_IC_1                      0x0    /* 00b	[5:4] */
#define R36_PB_HP_BIAS_IC_1                       0x0    /* 00b	[7:6] */
#define R36_PB_BCKEND_LEFT_ENABLE_IC_1_MASK       0x1
#define R36_PB_BCKEND_LEFT_ENABLE_IC_1_SHIFT      0
#define R36_PB_BCKEND_RIGHT_ENABLE_IC_1_MASK      0x2
#define R36_PB_BCKEND_RIGHT_ENABLE_IC_1_SHIFT     1
#define R36_PB_BACK_CTRL_IC_1_MASK                0xC
#define R36_PB_BACK_CTRL_IC_1_SHIFT               2
#define R36_PB_DAC_BIAS_IC_1_MASK                 0x30
#define R36_PB_DAC_BIAS_IC_1_SHIFT                4
#define R36_PB_HP_BIAS_IC_1_MASK                  0xC0
#define R36_PB_HP_BIAS_IC_1_SHIFT                 6

/* DAC Control 0 (IC 1) */
#define R37_DACC0_ENABLE_IC_1                     0x3    /* 11b	[1:0] */
#define R37_DACC0_DE_EMPH_FILTER_ENA_IC_1         0x0    /* 0b	[2] */
#define R37_DACC0_LEFT_DIGITAL_MUTE_IC_1          0x0    /* 0b	[3] */
#define R37_DACC0_RIGHT_DIGITAL_MUTE_IC_1         0x0    /* 0b	[4] */
#define R37_DACC0_INV_INPUT_POL_IC_1              0x0    /* 0b	[5] */
#define R37_DACC0_MONO_MODE_IC_1                  0x0    /* 00b	[7:6] */
#define R37_DACC0_ENABLE_IC_1_MASK                0x3
#define R37_DACC0_ENABLE_IC_1_SHIFT               0
#define R37_DACC0_DE_EMPH_FILTER_ENA_IC_1_MASK    0x4
#define R37_DACC0_DE_EMPH_FILTER_ENA_IC_1_SHIFT   2
#define R37_DACC0_LEFT_DIGITAL_MUTE_IC_1_MASK     0x8
#define R37_DACC0_LEFT_DIGITAL_MUTE_IC_1_SHIFT    3
#define R37_DACC0_RIGHT_DIGITAL_MUTE_IC_1_MASK    0x10
#define R37_DACC0_RIGHT_DIGITAL_MUTE_IC_1_SHIFT   4
#define R37_DACC0_INV_INPUT_POL_IC_1_MASK         0x20
#define R37_DACC0_INV_INPUT_POL_IC_1_SHIFT        5
#define R37_DACC0_MONO_MODE_IC_1_MASK             0xC0
#define R37_DACC0_MONO_MODE_IC_1_SHIFT            6

/* DAC Control 1 (IC 1) */
#define R38_DACC1_ADC_LEFT_CHANNEL_IC_1           0x00   /* 00000000b	[7:0] */
#define R38_DACC1_ADC_LEFT_CHANNEL_IC_1_MASK      0xFF
#define R38_DACC1_ADC_LEFT_CHANNEL_IC_1_SHIFT     0

/* DAC Control 2 (IC 1) */
#define R39_DACC2_ADC_RIGHT_CHANNEL_IC_1          0x00   /* 00000000b	[7:0] */
#define R39_DACC2_ADC_RIGHT_CHANNEL_IC_1_MASK     0xFF
#define R39_DACC2_ADC_RIGHT_CHANNEL_IC_1_SHIFT    0

/* Serial Port Pad Control 0 (IC 1) */
#define R40_BCLKP_IC_1                            0x2    /* 10b	[1:0] */
#define R40_LRCLKP_IC_1                           0x2    /* 10b	[3:2] */
#define R40_DACSDP_IC_1                           0x2    /* 10b	[5:4] */
#define R40_ADCSDP_IC_1                           0x2    /* 10b	[7:6] */
#define R40_BCLKP_IC_1_MASK                       0x3
#define R40_BCLKP_IC_1_SHIFT                      0
#define R40_LRCLKP_IC_1_MASK                      0xC
#define R40_LRCLKP_IC_1_SHIFT                     2
#define R40_DACSDP_IC_1_MASK                      0x30
#define R40_DACSDP_IC_1_SHIFT                     4
#define R40_ADCSDP_IC_1_MASK                      0xC0
#define R40_ADCSDP_IC_1_SHIFT                     6

/* Comm Port Pad Ctrl 0 (IC 1) */
#define R41_SDAP_PULL_UP_DOWN_IC_1                0x2    /* 10b	[1:0] */
#define R41_SCLP_PULL_UP_DOWN_IC_1                0x2    /* 10b	[3:2] */
#define R41_CLATCH_PULL_UP_DOWN_IC_1              0x2    /* 10b	[5:4] */
#define R41_CDATA_PULL_UP_DOWN_IC_1               0x2    /* 10b	[7:6] */
#define R41_SDAP_PULL_UP_DOWN_IC_1_MASK           0x3
#define R41_SDAP_PULL_UP_DOWN_IC_1_SHIFT          0
#define R41_SCLP_PULL_UP_DOWN_IC_1_MASK           0xC
#define R41_SCLP_PULL_UP_DOWN_IC_1_SHIFT          2
#define R41_CLATCH_PULL_UP_DOWN_IC_1_MASK         0x30
#define R41_CLATCH_PULL_UP_DOWN_IC_1_SHIFT        4
#define R41_CDATA_PULL_UP_DOWN_IC_1_MASK          0xC0
#define R41_CDATA_PULL_UP_DOWN_IC_1_SHIFT         6

/* Comm Port Pad Ctrl 1 (IC 1) */
#define R42_CPPC1_SDACOUT_IC_1                    0x0    /* 0b	[0] */
#define R42_CPPC1_SDACOUT_IC_1_MASK               0x1
#define R42_CPPC1_SDACOUT_IC_1_SHIFT              0

/* JackRegister (IC 1) */
#define R43_MCLK_JACK_PULLUP_IC_1                 0x2    /* 10b	[3:2] */
#define R43_MCLK_JACK_STRENGTH_IC_1               0x0    /* 0b	[5] */
#define R43_MCLK_JACK_PULLUP_IC_1_MASK            0xC
#define R43_MCLK_JACK_PULLUP_IC_1_SHIFT           2
#define R43_MCLK_JACK_STRENGTH_IC_1_MASK          0x20
#define R43_MCLK_JACK_STRENGTH_IC_1_SHIFT         5

/* Dejitter Register Control (IC 1) */
#define R44_DEJITTER_IC_1                         0x03   /* 00000011b	[7:0] */
#define R44_DEJITTER_IC_1_MASK                    0xFF
#define R44_DEJITTER_IC_1_SHIFT                   0

/* CRC Ideal_1 (IC 1) */
#define R45_CRC_IDEAL_1_IC_1                      0x3A   /* 00111010b	[7:0] */
#define R45_CRC_IDEAL_1_IC_1_MASK                 0xFF
#define R45_CRC_IDEAL_1_IC_1_SHIFT                0

