olegator1506/audio/progs/esp32-adau/include/my-project1_IC_1_REG.h
/* Clock Enable Reg 0 (IC 1) */
#define R69_SERIAL_PORT_IC_1                      0x1    /* 1b	[0] */
#define R69_ROUTING_MATRIX_IN_IC_1                0x1    /* 1b	[1] */
#define R69_INTERPOLATOR_RESYNC_IC_1              0x1    /* 1b	[2] */
#define R69_ROUTING_MATRIX_OUT_IC_1               0x1    /* 1b	[3] */
#define R69_DECIMATOR_RESYNC_IC_1                 0x1    /* 1b	[4] */
#define R69_ALC_ON_IC_1                           0x1    /* 1b	[5] */
#define R69_SLEW_ON_IC_1                          0x1    /* 1b	[6] */
#define R69_SERIAL_PORT_IC_1_MASK                 0x1
#define R69_SERIAL_PORT_IC_1_SHIFT                0
#define R69_ROUTING_MATRIX_IN_IC_1_MASK           0x2
#define R69_ROUTING_MATRIX_IN_IC_1_SHIFT          1
#define R69_INTERPOLATOR_RESYNC_IC_1_MASK         0x4
#define R69_INTERPOLATOR_RESYNC_IC_1_SHIFT        2
#define R69_ROUTING_MATRIX_OUT_IC_1_MASK          0x8
#define R69_ROUTING_MATRIX_OUT_IC_1_SHIFT         3
#define R69_DECIMATOR_RESYNC_IC_1_MASK            0x10
#define R69_DECIMATOR_RESYNC_IC_1_SHIFT           4
#define R69_ALC_ON_IC_1_MASK                      0x20
#define R69_ALC_ON_IC_1_SHIFT                     5
#define R69_SLEW_ON_IC_1_MASK                     0x40
#define R69_SLEW_ON_IC_1_SHIFT                    6

/* Clock Enable Reg 1 (IC 1) */
#define R70_CLOCK_GENERATOR_0_IC_1                0x1    /* 1b	[0] */
#define R70_CLOCK_GENERATOR_1_IC_1                0x1    /* 1b	[1] */
#define R70_CLOCK_GENERATOR_0_IC_1_MASK           0x1
#define R70_CLOCK_GENERATOR_0_IC_1_SHIFT          0
#define R70_CLOCK_GENERATOR_1_IC_1_MASK           0x2
#define R70_CLOCK_GENERATOR_1_IC_1_SHIFT          1

#endif
